10/10
ability
able
absolute
absolutely
absurd
academy
accent
accept
accident
according
accurate
act
acted
acting
action
actions
actor
actors
actress
actresses
acts
actual
actually
adaptation
add
added
addition
adds
admit
adult
adults
adventure
affair
afraid
age
agent
ago
agree
ahead
air
al
alive
allow
allowed
amazing
america
american
americans
amusing
angry
animal
animals
animated
animation
annoying
answer
anti
anybody
anymore
apart
apartment
apparent
apparently
appeal
appear
appearance
appeared
appears
appreciate
approach
area
army
art
artist
artistic
aside
ask
asked
asks
aspect
aspects
atmosphere
attack
attempt
attempts
attention
attractive
audience
audiences
available
average
avoid
award
aware
away
awesome
awful
baby
background
bad
badly
band
bar
barely
based
basic
basically
battle
beat
beautiful
beautifully
beauty
bed
began
begin
beginning
begins
believable
believe
ben
best
better
big
biggest
bill
billy
bit
bits
bizarre
black
blame
bland
blood
bloody
blue
body
book
books
bored
boring
born
boss
bother
bought
box
boy
boyfriend
boys
brain
break
brian
brief
bright
brilliant
bring
brings
british
brother
brothers
brought
brutal
budget
build
building
bunch
business
buy
cable
called
came
camera
camp
capture
car
care
career
carry
cartoon
case
cast
casting
cat
catch
caught
cause
central
century
certain
certainly
chance
change
changed
changes
channel
character
characters
charles
charm
charming
chase
cheap
check
cheesy
chemistry
child
childhood
children
choice
chris
christmas
christopher
church
cinema
cinematic
cinematography
city
class
classic
clear
clearly
clever
climax
close
clothes
club
co
cold
collection
college
color
come
comedic
comedies
comedy
comes
comic
coming
comment
commentary
comments
common
community
company
compare
compared
compelling
complete
completely
complex
computer
concept
concerned
conclusion
confused
confusing
consider
considered
considering
constant
constantly
contains
content
continue
continues
control
convincing
cool
cop
copy
costumes
count
country
couple
course
cover
crap
crazy
create
created
creating
creative
creature
credit
credits
creepy
crew
crime
criminal
critics
cross
cry
cult
culture
cut
cute
cuts
dad
damn
dance
dancing
dangerous
dark
date
daughter
david
day
days
de
dead
deal
dealing
death
decent
decide
decided
decides
deep
deeply
definitely
delightful
deliver
delivers
depth
describe
deserve
deserved
deserves
design
desire
desperate
despite
detail
details
detective
developed
development
dialog
dialogue
die
died
dies
difference
different
difficult
direct
directed
directing
direction
director
directors
dirty
disappointed
disappointing
disappointment
disaster
discover
discovered
disney
disturbing
doctor
documentary
dog
door
double
doubt
dr.
drama
dramatic
drawn
dream
dreams
drive
driving
drug
drugs
drunk
dull
dumb
dvd
dying
earlier
early
earth
easily
easy
edge
editing
effect
effective
effects
effort
element
elements
emotion
emotional
emotions
end
ended
ending
ends
energy
engaging
england
english
enjoy
enjoyable
enjoyed
entertaining
entertainment
entire
entirely
epic
episode
episodes
equally
era
escape
especially
essentially
etc
european
event
events
eventually
everybody
evil
ex
exactly
example
excellent
exception
exciting
excuse
exist
expect
expectations
expected
expecting
experience
explain
explained
explanation
extra
extreme
extremely
eye
eyes
face
faces
fact
fail
failed
fails
fair
fairly
fake
fall
falling
falls
familiar
family
famous
fan
fans
fantastic
fantasy
far
fascinating
fashion
fast
father
favorite
favourite
fear
feature
features
featuring
feel
feeling
feelings
feels
fell
fellow
felt
female
festival
fi
fiction
field
fight
fighting
fights
figure
filled
film
filmed
filming
filmmaker
filmmakers
films
final
finally
find
finding
finds
fine
finest
finish
finished
fire
fit
flat
flaws
flick
flicks
floor
flying
focus
folks
follow
followed
following
follows
food
footage
force
forced
forever
forget
forgotten
form
forward
found
frank
free
french
fresh
friend
friends
fully
fun
funniest
funny
future
game
gang
garbage
gave
gay
gem
general
generally
genius
genre
george
german
gets
getting
ghost
giant
girl
girlfriend
girls
given
gives
giving
glad
god
goes
going
gone
good
gore
gorgeous
got
gotten
government
grace
grade
grand
great
greatest
green
ground
group
growing
guess
gun
guy
guys
hair
half
hand
hands
happen
happened
happening
happens
happy
hard
hardly
hate
hated
having
head
heads
hear
heard
heart
heavy
held
hell
help
helped
helps
hero
heroes
hey
hidden
high
higher
highly
hilarious
historical
history
hit
hits
hold
holds
holes
hollywood
home
honest
honestly
hope
hopes
hoping
horrible
horror
hospital
hot
hotel
hour
hours
house
huge
human
humor
humour
hurt
husband
idea
ideas
ii
ill
image
images
imagination
imagine
imdb
immediately
impact
important
impossible
impressed
impression
impressive
include
included
includes
including
incredible
incredibly
independent
indian
industry
information
innocent
inside
inspired
instance
instead
intelligence
intelligent
intended
intense
interest
interested
interesting
intriguing
introduced
involved
involving
island
issue
issues
italian
jack
james
jane
japanese
jason
jean
jim
job
joe
john
joke
jokes
jones
journey
joy
jump
justice
keeping
keeps
kept
key
kid
kids
kill
killed
killer
killing
kills
kind
kinda
king
knew
know
knowing
knowledge
known
knows
la
lack
lacking
lacks
ladies
lady
lame
land
language
large
late
later
laugh
laughable
laughed
laughing
laughs
law
lead
leading
leads
learn
leave
leaves
leaving
led
lee
left
length
let
lets
level
lies
life
light
lighting
likable
like
liked
likely
likes
limited
line
lines
list
listen
literally
little
live
lived
lives
living
local
location
london
long
longer
look
looked
looking
looks
loose
lord
lose
lost
lot
lots
loud
love
loved
lovely
lover
lovers
loves
loving
low
lucky
machine
mad
magic
main
mainly
major
makers
makes
making
male
man
manage
managed
manages
manner
mark
marriage
married
martin
mary
master
masterpiece
match
material
matter
maybe
mean
meaning
means
meant
mediocre
meet
meets
member
members
memorable
memories
memory
men
mental
mention
mentioned
merely
mess
message
met
michael
middle
military
million
mind
minor
minute
minutes
miss
missed
missing
mistake
mix
mixed
modern
mom
moment
moments
money
monster
months
mood
moral
mother
motion
mouth
moved
moves
movie
movies
moving
mr.
murder
murders
music
musical
mysterious
mystery
naked
named
names
narrative
nasty
natural
naturally
nature
near
nearly
necessary
need
needed
needs
negative
new
news
nice
nicely
night
noir
non
nonsense
normal
normally
note
notice
noticed
novel
nt
nudity
number
numbers
numerous
obvious
obviously
odd
offer
offers
office
oh
ok
okay
old
older
ones
open
opening
opens
opera
opinion
opportunity
opposite
order
original
originally
oscar
outside
outstanding
overall
pace
paced
pacing
paid
pain
painful
parents
park
particular
particularly
partner
parts
party
pass
passion
past
pathetic
paul
pay
people
perfect
perfectly
performance
performances
period
person
personal
personality
personally
peter
phone
photography
physical
pick
picked
picture
pictures
piece
pieces
place
places
plain
plan
planet
play
played
player
players
playing
plays
pleasure
plenty
plot
plots
plus
point
pointless
points
police
political
poor
poorly
pop
popular
porn
portray
portrayal
portrayed
positive
possible
possibly
post
potential
power
powerful
powers
pre
predictable
premise
presence
present
presented
pretty
previous
prison
probably
problem
problems
process
produced
producer
producers
production
professional
project
prove
proves
provide
provides
public
pull
pulled
pure
purpose
puts
putting
quality
queen
question
questions
quick
quickly
quiet
race
random
rape
rare
rarely
rate
rated
rating
ray
read
reading
ready
real
realism
realistic
reality
realize
realized
reason
reasons
received
recent
recently
recommend
recommended
record
red
redeeming
regular
relationship
relationships
release
released
remains
remake
remarkable
remember
reminded
reminds
rent
rented
respect
responsible
rest
result
results
return
returns
revenge
review
reviews
rich
richard
ride
ridiculous
right
rip
road
robert
rock
role
roles
roll
romance
romantic
room
rubbish
run
running
runs
sad
sadly
said
sam
sat
save
saved
saving
saw
saying
says
scared
scary
scene
scenery
scenes
school
sci
science
score
scott
screen
screenplay
script
search
season
second
seconds
secret
seeing
seemingly
seen
sees
self
sense
sent
sequel
sequence
sequences
serial
series
seriously
set
sets
setting
seven
sex
sexual
sexy
shame
share
shock
shocking
shoot
shooting
short
shot
shots
showed
showing
shown
shows
sick
sight
sign
silent
silly
similar
simple
simply
singing
single
sister
sit
sitting
situation
situations
skip
slasher
sleep
slightly
slow
slowly
small
smart
smile
smith
social
society
soft
soldiers
solid
somebody
somewhat
son
song
songs
soon
sorry
sort
soul
sound
sounds
soundtrack
south
space
speak
speaking
special
spend
spent
spirit
spoiler
spoilers
spot
stage
stand
standard
standards
stands
star
starring
stars
start
started
starting
starts
state
states
station
stay
step
stephen
steve
stick
stop
store
stories
story
storyline
straight
strange
street
strong
struggle
stuck
student
students
studio
stuff
stunning
stupid
style
sub
subject
subtle
success
successful
sucks
suddenly
suggest
suicide
suit
summer
super
superb
superior
support
supporting
suppose
supposed
supposedly
sure
surely
surprise
surprised
surprising
surprisingly
suspect
suspense
sweet
system
taken
takes
taking
tale
talent
talented
talents
talk
talking
taste
teacher
team
tears
technical
teen
teenage
television
tell
telling
tells
tension
terms
terrible
terribly
terrific
thank
thanks
theater
theatre
theme
themes
thin
thing
things
think
thinking
thinks
thoroughly
thought
thriller
throw
thrown
time
times
tired
title
today
told
tom
tone
tony
took
torture
total
totally
touch
touching
tough
town
track
tragedy
tragic
trailer
train
trash
treat
treated
tried
tries
trip
trouble
true
truly
trust
truth
try
trying
turn
turned
turning
turns
tv
twice
twist
twists
type
typical
ugly
ultimately
unbelievable
understand
understanding
unfortunately
unique
unknown
unlike
unnecessary
unusual
use
uses
usual
usually
utterly
value
values
van
version
vhs
victim
victims
video
view
viewer
viewers
viewing
villain
violence
violent
vision
visit
visual
voice
wait
waiting
walk
walking
wall
want
wanted
wanting
wants
war
warning
waste
wasted
watch
watchable
watched
watching
water
way
ways
weak
wearing
week
weird
went
west
western
whatsoever
white
wide
wife
wild
william
willing
win
winning
wise
wish
witty
wo
woman
women
won
wonder
wonderful
wonderfully
wondering
wooden
woods
word
words
work
worked
working
works
world
worse
worst
worth
worthy
wow
write
writer
writers
writing
written
wrong
wrote
yeah
year
years
yes
york
young
younger
zero
zombie
zombies
